###Для данной 
---
модели необходимо определить состав сущностей, состав атрибутов и ключи всех сущностей, связи между сущностями и их кратности.
---

![4el](https://i0.wp.com/www.galvanizeaction.org/wp-content/uploads/2022/06/Wow-gif.gif?fit=450%2C250&ssl=1)

Правила:
- Только реляционные данные. Следует чётко понимать, что цель ER-диаграмм — показать связи и отношения между элементами, поэтому они отображают только реляционную структуру.
- Только для структурированных данных. Данные должны быть чётко разбиты на поля, столбцы и строки, иначе пользы от ER-диаграммы будет мало. Это касается и частично структурированных данных, так как только некоторые из них будут пригодны для работы. 
